Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B06C.tmx
Source language: en_us
Languages: zh_cn

source: Great-power politics: The new game
zh_cn: 大国政治：新游戏

source: American dominance is being challenged
zh_cn: 美国的主导地位正在受到挑战

source: A CONTINENT separates the blood-soaked battlefields of Syria from the reefs and shoals that litter the South China Sea. In their different ways, however, both places are witnessing the most significant shift in great-power relations since the collapse of the Soviet Union.
zh_cn: 叙利亚的浴血战场和南中国海之间相隔一块大陆，但两地都在以不同的方式上演苏联解体以来大国关系最重大的转变。

source: In Syria, for the first time since the cold war, Russia has deployed its forces far from home to quell a revolution and support a client regime.
zh_cn: 自冷战结束以来，俄罗斯首次在远离本土的叙利亚部署武装力量，以镇压叙利亚革命和支持附庸政权。

source: In the waters between Vietnam and the Philippines, America will soon signal that it does not recognise China's territorial claims over a host of outcrops and reefs by exercising its right to sail within the 12-mile maritime limit that a sovereign state controls.
zh_cn: 在越南和菲律宾之间的海域，美国将很快在主权国家控制的12海里界限内行使航行权利，以显示不认可中国对多处岛礁的领土主张。

source: For the past 25 years America has utterly dominated great-power politics. Increasingly, it lives in a contested world.
zh_cn: 过去25年来，大国政治舞台完全由美国所主导，但这个世界的争夺正变得越发激烈。

source: The new game with Russia and China that is unfolding in Syria and the South China Sea is a taste of the struggle ahead.
zh_cn: 美国、俄罗斯、中国在叙利亚和南中国海展开的新游戏颇有斗争将至的味道。

source: Facts on the ground
zh_cn: 既成事实

source: As ever, that struggle is being fought partly in terms of raw power.
zh_cn: 这场斗争一定程度上拼的仍旧是蛮力。

source: Vladimir Putin has intervened in Syria to tamp down jihadism and to bolster his own standing at home.
zh_cn: 弗拉基米尔·普京对叙利亚进行了干预，目的是打击圣战运动和提升自己的国内地位。

source: But he also means to show that, unlike America, Russia can be trusted to get things done in the Middle East and win friends by, for example, offering Iraq an alternative to the United States (see article).
zh_cn: 但他也意在表明俄罗斯比美国值得信任，可以把中东的事情做好和赢得朋友，比如伊拉克有了美国之外的选择。

source: Lest anyone presume with John McCain, an American senator, that Russia is just "a gas station masquerading as a country", Mr Putin intends to prove that Russia possesses resolve, as well as crack troops and cruise missiles.
zh_cn: 为了避免有人像美国参议员约翰麦凯恩那样设想俄罗斯只是一个“打着国家幌子的加油站”，普京意在证明俄罗斯除了劲旅和巡航导弹之外还拥有决心。

source: The struggle is also over legitimacy.
zh_cn: 这场斗争也是为了合法性而战。

source: Mr Putin wants to discredit America's stewardship of the international order. America argues that popular discontent and the Syrian regime's abuses of human rights disqualify the president, Bashar al-Assad, from power.
zh_cn: 普京想羞辱美国对国际秩序的管理，美国认为叙利亚民怨四起，政府侵犯人权，因此现任总统巴沙尔阿萨德没有资格继续执政。
